This Notebook contains following steps:

- merging all dataframes

In [1]:
# importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# creating path shortcut:
path=r'/Users/parvinrahimi/Desktop/Data/Data Immersion/Achievement 4/TASK 3/06-2023 Instacart Basket Analysis 9.46.07 AM'

In [4]:
# importing dataframe
df_1 = pd.read_pickle(os.path.join(path, '01 Project Management', 'Prepared Data', 'merged_last_4.9.pkl'))

In [5]:
# importing dataframe
df_2 = pd.read_csv(os.path.join(path, '01 Project Management','Original Data', 'customers.csv'))

In [6]:
# Exporting df_2 as pkl
df_2.to_pickle(os.path.join(path,'01 Project Management','Original Data', 'customers.pkl'))

In [7]:
# importing dataframe
df_3 = pd.read_pickle(os.path.join(path, '01 Project Management', 'Original Data', 'customers.pkl'))

In [8]:
# changing the type of column user_id to string for consistency reasons to merge
df_3['user_id'] = df_3['user_id'].astype('str')

In [9]:
# changing the type of column user_id to string for consistency reasons to merge
df_1['user_id'] = df_1['user_id'].astype('str')

In [13]:
df_3.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [15]:
# dropping columns 
df_3 = df_3.drop (columns = ['First Name', 'Surnam', 'Gender', 'STATE', 'Age', 'date_joined', 'fam_status','income'])

In [16]:
df_3.head()

  user_id  n_dependants
0   26711             3
1   33890             0
2   65803             2
3  125935             0
4  130797             1

In [17]:
# inner joing dataframes
final_df = df_1.merge(df_3, on = 'user_id', indicator = True)

In [18]:
# datatypes of dataframe
final_df.dtypes

user_id                     object
first_name                  object
surname                     object
gender                      object
state                       object
age                          int64
date_joined                 object
fam_status                  object
income                       int64
order_id                     int64
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
last_order_in_days         float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
price_range_loc             object
busiest_day                 object
Busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
average_price              float64
spending_flag               object
median_days_last_order     float64
order_frequency_flag        object
n_dependants                 int64
_merge                    category
dtype: object

In [19]:
#renaming column n_dependants
final_df.rename(columns = {'n_dependants' : 'number_of_dependants'}, inplace = True)

In [20]:
# dropping columns 
final_df = final_df.drop (columns = ['_merge'])

In [21]:
final_df.head()

,user_id,first_name,surname,gender,state,age,date_joined,fam_status,income,order_id,...,busiest_day,Busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_price,spending_flag,median_days_last_order,order_frequency_flag,number_of_dependants
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,married,165665,2543867,...,Regularly busy,Busiest days,Most_orders,8,New customer,7.988889,Low spender,19.0,Regular customer,3
1,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,married,165665,1285508,...,Regularly busy,Regularly busy,Most_orders,8,New customer,7.988889,Low spender,19.0,Regular customer,3
2,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,married,165665,2578584,...,Regularly busy,Busiest days,Most_orders,8,New customer,7.988889,Low spender,19.0,Regular customer,3
3,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,married,165665,423547,...,Regularly busy,Regularly busy,Most_orders,8,New customer,7.988889,Low spender,19.0,Regular customer,3
4,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,married,165665,2524893,...,Regularly busy,Least busiest days,Most_orders,8,New customer,7.988889,Low spender,19.0,Regular customer,3

In [22]:
final_df.shape

(32404859, 32)

In [24]:
# exporting as pkl
final_df.to_pickle(os.path.join(path, '01 Project Management', 'Prepared Data', 'final_data.pkl'))